In [10]:
import mysql.connector as sql
import pandas as pd

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    buffered = True,        # using this for reading table, panda dont need it
    database = "sql_intro"
)

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user


print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7fbfd183d9f0>

In [12]:

# 營收(Revenue)，或稱為營業額
# 比方說，某咖啡店當天賣了100杯咖啡，每杯150元，
# 當天的營收就記為150*100=15000元。
#! calcute revenue through sales table and c_product table
# sales table
#     product_id	sell_price	 qty	    state
# 0	121	                320.0	        3	california
# 1	121	                320.0	        6	taxas
# 2	121	                320.0	        4	alaska
# 3	123	                290.0	        2	taxas
# 4	123	                290.0	        7	california
# 5	123	                290.0	        4	washington
# 6	121	                320.0	        7	ohio
# 7	121	                320.0	        2	Arizona
# 8	123	                290.0	        8	colorado


# c_product table   for cost
# 	product_id	cost_price
# 0	121	                270.0
# 1	123	                250.0

sql_query = """

SELECT s.product_id , sum( (s.sell_price - c.cost_price ) * s.qty ) AS revenue
FROM sales AS s
INNER JOIN c_product as c
ON s.product_id = c.product_id
GROUP BY product_id;
"""

pd_content = pd.read_sql_query(
    sql_query,
    mydb
)
pd_content

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   product_id  revenue
0         121   1100.0
1         123    840.0

In [ ]:
# create table sales (
#     product_id int,
#     sell_price float,
#     qty int,
#     state VARCHAR(20)
# )


# show databases;

# use sql_intro;
# show tables;
# describe sales;
# 'product_id', 'int', 'YES', '', NULL, ''
# 'sell_price', 'float', 'YES', '', NULL, ''
# 'qty', 'int', 'YES', '', NULL, ''
# 'state', 'varchar(20)', 'YES', '', NULL, ''

# insert into sales values 
# (121,320.0,3,"california"),
# (121,320.0,6,"taxas"),
# (121,320.0,4,"alaska"),
# (123,290.0,2,"taxas"),
# (123,290.0,7,"california"),
# (123,290.0,4,"washington"),
# (121,320.0,7,"ohio"),
# (121,320.0,2,"Arizona"),
# (123,290.0,8,"colorado");

# select * from sales;


# create c_product (
# product_id int,
# cost_price float)


# insert into c_product
# values(121,270),
# 	  (123,250);